In [3]:
import pandas as pd

Ejercicio 1. Crear una serie de pandas de la siguiente variable.

edades = [22,13,8,33,25,44,38,22]

In [1]:
edades = [22,13,8,33,25,44,38,22]
edades

[22, 13, 8, 33, 25, 44, 38, 22]

In [4]:
serie = pd.Series(edades)
serie

0    22
1    13
2     8
3    33
4    25
5    44
6    38
7    22
dtype: int64

Ejercicio 2.  Obtener los primeros 5 registros utilizando head.

In [5]:
serie.head()

0    22
1    13
2     8
3    33
4    25
dtype: int64

Obtener los ultimos 3 registros utilizando tail.

In [8]:
serie.tail(3)

5    44
6    38
7    22
dtype: int64

Obtener el valor minimo de la serie

In [9]:
serie.min()

np.int64(8)

Obtener el valor maximo de la serie

In [10]:
serie.max()

np.int64(44)

Obtener el valor promedio de la serie

In [11]:
serie.mean()

np.float64(25.625)

Ejercicio 4. Obtener el valor en la segunda posicion de la serie.

In [12]:
serie[1]

np.int64(13)

In [14]:
serie.get(1)

np.int64(13)

Ejercicio 5. Obtener los registros que tengan un valor igual a 22

In [15]:
serie == 22

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [16]:
serie[serie==22]

0    22
7    22
dtype: int64

Ejercicio 6. Crear una segunda serie utilizando los siguientes datos:
edades2=[23,15,12,25,20,50,31,2]

In [23]:
edades2=[23,15,12,25,20,50,31,2]
edades2

[23, 15, 12, 25, 20, 50, 31, 2]

In [24]:
serie2=pd.Series(edades2)
serie2

0    23
1    15
2    12
3    25
4    20
5    50
6    31
7     2
dtype: int64

Sumar ambas series

In [21]:
serie + serie2

0    45
1    28
2    20
3    58
4    45
5    94
6    69
7    24
dtype: int64

In [25]:
edades + edades2

[22, 13, 8, 33, 25, 44, 38, 22, 23, 15, 12, 25, 20, 50, 31, 2]

In [28]:
edades3=[2]
edades3

[2]

In [29]:
serie3 = pd.Series(edades3)
serie3

0    2
dtype: int64

In [30]:
serie3 + serie

0    24.0
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64

Ejercicio 7. Re-ordenar la serie anterior invirtiendo los indices con sort_index()

In [32]:
serie2 = serie2.sort_index(ascending=False)
serie2

7     2
6    31
5    50
4    20
3    25
2    12
1    15
0    23
dtype: int64

Volver a sumar ambas series.

In [33]:
serie + serie2

0    45
1    28
2    20
3    58
4    45
5    94
6    69
7    24
dtype: int64

Ejercicio 8. Restar a todos los elementos de la primera serie 5 unidades.

In [34]:
serie - 5

0    17
1     8
2     3
3    28
4    20
5    39
6    33
7    17
dtype: int64

Ejercicio 9. Calcula el cuadrado de todos los valores en la serie utilizando map

In [35]:
def cuadrado(x):
    return x*x

serie.map(cuadrado)

0     484
1     169
2      64
3    1089
4     625
5    1936
6    1444
7     484
dtype: int64

Ejercicio 10. Crea un DataFrame con pandas llamado "paises" utilizando el siguiente diccionario de datos.

In [36]:
datos = {
    "nombre":       ["Argentina","Brasil","Chile","Colombia","Ecuador","Paraguay","Peru"],
    "capital":      ["Buenos Airea","Brasilia","Santiago de Chile","Bogota","Quito","Asuncion","Lima"],
    "Poblacion":    [45380000,212600000,19120000,50880000,17640000,7133000,32970000],
    "sup. en km2":  [2780000,8516000,756950,1143000,283560,406752,1285216]
}

In [38]:
paises = pd.DataFrame(datos)

In [39]:
paises

      nombre            capital  Poblacion  sup. en km2
0  Argentina       Buenos Airea   45380000      2780000
1     Brasil           Brasilia  212600000      8516000
2      Chile  Santiago de Chile   19120000       756950
3   Colombia             Bogota   50880000      1143000
4    Ecuador              Quito   17640000       283560
5   Paraguay           Asuncion    7133000       406752
6       Peru               Lima   32970000      1285216

Ejercicio 11. Visualizar los primeros 5 y los ultimos 3 elementos del DataFrame anterior

In [40]:
paises.head()

      nombre            capital  Poblacion  sup. en km2
0  Argentina       Buenos Airea   45380000      2780000
1     Brasil           Brasilia  212600000      8516000
2      Chile  Santiago de Chile   19120000       756950
3   Colombia             Bogota   50880000      1143000
4    Ecuador              Quito   17640000       283560

In [41]:
paises.tail(3)

     nombre   capital  Poblacion  sup. en km2
4   Ecuador     Quito   17640000       283560
5  Paraguay  Asuncion    7133000       406752
6      Peru      Lima   32970000      1285216

In [45]:
paises[4:7]

     nombre   capital  Poblacion  sup. en km2
4   Ecuador     Quito   17640000       283560
5  Paraguay  Asuncion    7133000       406752
6      Peru      Lima   32970000      1285216

Ejercicio 12. Crear un DataFrame utilizando el diccionario anterior de datos unicamente con las columnas nombre y problacion.

In [46]:
paises

      nombre            capital  Poblacion  sup. en km2
0  Argentina       Buenos Airea   45380000      2780000
1     Brasil           Brasilia  212600000      8516000
2      Chile  Santiago de Chile   19120000       756950
3   Colombia             Bogota   50880000      1143000
4    Ecuador              Quito   17640000       283560
5   Paraguay           Asuncion    7133000       406752
6       Peru               Lima   32970000      1285216

In [47]:
paises2 = pd.DataFrame(datos, columns=["nombre","Poblacion"] )

In [48]:
paises2

      nombre  Poblacion
0  Argentina   45380000
1     Brasil  212600000
2      Chile   19120000
3   Colombia   50880000
4    Ecuador   17640000
5   Paraguay    7133000
6       Peru   32970000

Ejercicio 13. Crear un DataFrame utilizando el diccionario de datos con la columna "nombre" como indice:

In [49]:
paises3 = pd.DataFrame(datos, index=datos["nombre"])

In [50]:
paises3

              nombre            capital  Poblacion  sup. en km2
Argentina  Argentina       Buenos Airea   45380000      2780000
Brasil        Brasil           Brasilia  212600000      8516000
Chile          Chile  Santiago de Chile   19120000       756950
Colombia    Colombia             Bogota   50880000      1143000
Ecuador      Ecuador              Quito   17640000       283560
Paraguay    Paraguay           Asuncion    7133000       406752
Peru            Peru               Lima   32970000      1285216

In [52]:
paises3 = pd.DataFrame(datos, index=datos["nombre"], columns=["capital", "Poblacion"])
paises3

                     capital  Poblacion
Argentina       Buenos Airea   45380000
Brasil              Brasilia  212600000
Chile      Santiago de Chile   19120000
Colombia              Bogota   50880000
Ecuador                Quito   17640000
Paraguay            Asuncion    7133000
Peru                    Lima   32970000

Ejercicio 14. Obtener los datos de la fila con el indice "Argentina"

In [53]:
paises3.loc["Argentina"]

capital      Buenos Airea
Poblacion        45380000
Name: Argentina, dtype: object

Ejercicio 15. Obtener la poblacion y capital de Argentina y Brasil utilizando la funcion loc.

In [54]:
paises3.loc[["Argentina","Brasil"],["Poblacion","capital"]]

           Poblacion       capital
Argentina   45380000  Buenos Airea
Brasil     212600000      Brasilia

Ejercicio 16. Obtener la informacion de los paises con una superficie mayor a 1 000 000 de km cuadrados utilizando loc.